; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Hanoi Tower Domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;Header and description

(define (domain hanoi)
  (:requirements :strips :disjunctive-preconditions)
  
  (:predicates
    (on ?x ?y)      ; disk ?x is on disk or peg ?y
    (clear ?x)      ; disk or peg ?x has nothing on top of it
    (smaller ?x ?y) ; disk ?x is smaller than disk ?y
    (disk ?x)       ; ?x is a disk
    (peg ?x)        ; ?x is a peg
  )
  
  (:action move
    :parameters (?disk ?from ?to)
    :precondition (and
      (disk ?disk)
      (clear ?disk)
      (clear ?to)
      (on ?disk ?from)
      (or (peg ?to)
          (and (disk ?to) (smaller ?disk ?to)))
    )
    :effect (and
      (not (on ?disk ?from))
      (not (clear ?to))
      (on ?disk ?to)
      (clear ?from)
    )
  )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Hanoi Tower Problem with 4 disks
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem hanoi-4)
  (:domain hanoi)
  
  (:objects d1 d2 d3 d4 p1 p2 p3)
  
  (:init
    ; Define objects
    (disk d1) (disk d2) (disk d3) (disk d4)
    (peg p1) (peg p2) (peg p3)
    
    ; Define disk sizes (d1 is smallest)
    (smaller d1 d2) (smaller d1 d3) (smaller d1 d4)
    (smaller d2 d3) (smaller d2 d4)
    (smaller d3 d4)
    
    ; Initial state - all disks stacked on peg 1
    (on d1 d2) (on d2 d3) (on d3 d4) (on d4 p1)
    (clear d1) (clear p2) (clear p3)
  )
  
  (:goal
    (and
      ; Goal: all disks stacked on peg 3
      (on d1 d2) (on d2 d3) (on d3 d4) (on d4 p3)
    )
  )
)

; plan
1. (move d1 d2 p2)
   deleted: (on d1 d2) (clear p2)
   added: (on d1 p2) (clear d2)
   goals met: 2 of 4
2. (move d2 d3 p3)
   deleted: (on d2 d3) (clear p3)
   added: (on d2 p3) (clear d3)
   goals met: 1 of 4
3. (move d1 p2 d2)
   deleted: (on d1 p2) (clear d2)
   added: (on d1 d2) (clear p2)
   goals met: 2 of 4
4. (move d3 d4 p2)
   deleted: (on d3 d4) (clear p2)
   added: (on d3 p2) (clear d4)
   goals met: 1 of 4
5. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (on d1 d4) (clear d2)
   goals met: 0 of 4
6. (move d2 p3 d3)
   deleted: (on d2 p3) (clear d3)
   added: (on d2 d3) (clear p3)
   goals met: 1 of 4
7. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (on d1 d2) (clear d4)
   goals met: 2 of 4
8. (move d4 p1 p3)
   deleted: (on d4 p1) (clear p3)
   added: (on d4 p3) (clear p1)
   goals met: 3 of 4
9. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (on d1 d4) (clear d2)
   goals met: 2 of 4
10. (move d2 d3 p1)
   deleted: (on d2 d3) (clear p1)
   added: (on d2 p1) (clear d3)
   goals met: 1 of 4
11. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (on d1 d2) (clear d4)
   goals met: 2 of 4
12. (move d3 p2 d4)
   deleted: (on d3 p2) (clear d4)
   added: (on d3 d4) (clear p2)
   goals met: 3 of 4
13. (move d1 d2 p2)
   deleted: (on d1 d2) (clear p2)
   added: (on d1 p2) (clear d2)
   goals met: 2 of 4
14. (move d2 p1 d3)
   deleted: (on d2 p1) (clear d3)
   added: (on d2 d3) (clear p1)
   goals met: 3 of 4
15. (move d1 p2 d2)
   deleted: (on d1 p2) (clear d2)
   added: (on d1 d2) (clear p2)
   goals met: 4 of 4
